# language: zh-CN

功能: 流量卡申请并在线支付订单测试

  背景:
    假如用户"aa"在公众号申请了一张大象卡
    而且填写了地址电话等订单信息
    而且生成订单号为"TEST201808101538560727T6tWk5ITI"的订单,支付金额为"9"元,订单类型为"2"

  场景: 当服务器接收到微信公众号支付回传信息时
    假如服务器成功接收到微信公众号支付回传信息
    而且服务器接收到订单为"TEST201808101538560727T6tWk5ITI"的支付报文
    当访问服务器"wxPayCallback"回传接口时
    那么订单"TEST201808101538560727T6tWk5ITI"的状态应该为"4"
    那么订单"TEST201808101538560727T6tWk5ITI"的userId应该不为空
    那么该订单对应的t_activity_card_info的状态应该为"1"
    那么该订单对应的t_activity_card_info的支付状态应该为"12"
    那么存在对应的状态为"1"的用户信息